---
kind: method
id: M:Autodesk.Revit.DB.DWFExportOptions.#ctor
source: html/5354da36-9bc9-6fd0-17a4-4b777f7f2381.htm
---
# Autodesk.Revit.DB.DWFExportOptions.#ctor Method

Default constructor. Sets all options to their default values.

## Syntax (C#)
```csharp
public DWFExportOptions()
```